[
    {
        "id": 1,
        "title": "Trải nghiệm Văn Miếu - Quốc Tử Giám",
        "title_key": "tour_title_1",
        "image": "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056781/van-mieu.jpg",
        "images": [
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056773/van-mieu-1.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056774/van-mieu-2.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056775/van-mieu-3.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056776/van-mieu-4.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056777/van-mieu-5.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056777/van-mieu-6.jpg"
        ],
        "rating": 4.8,
        "reviews": 342,
        "price": 19.0,
        "type": [
            "Tour chill cuối tuần",
            "Tour gia đình",
            "Tour trường học",
            "Tour chill thu Hà Nội"
        ],
        "departure": "hanoi",
        "destination": "vietnam",
        "transportation": "bus",
        "description": "Văn Miếu - Quốc Tử Giám là quần thể di tích lịch sử - văn hóa tiêu biểu của Thủ đô Hà Nội, tọa lạc tại quận Đống Đa, cách trung tâm thành phố không xa. Được xây dựng từ năm 1070, nơi đây là trường đại học đầu tiên của Việt Nam, gắn liền với truyền thống hiếu học và tôn vinh đạo học của dân tộc.\r\nTheo sử sách ghi lại, Văn Miếu được lập để thờ Khổng Tử và các bậc hiền triết, còn Quốc Tử Giám là nơi đào tạo nhân tài cho đất nước qua nhiều triều đại phong kiến. Trải qua thời gian, quần thể di tích vẫn lưu giữ nhiều công trình kiến trúc giá trị như Khuê Văn Các, giếng Thiên Quang, các bia Tiến sĩ, phản ánh rõ nét tinh thần trọng chữ nghĩa và học vấn của người Việt xưa.\r\nĐến với Văn Miếu - Quốc Tử Giám, du khách không chỉ được tham quan, tìm hiểu về lịch sử giáo dục và truyền thống hiếu học của dân tộc mà còn cảm nhận rõ không khí trang nghiêm, trầm lắng của một không gian thấm đẫm tinh thần đạo học. Nơi đây từ lâu đã trở thành điểm đến quen thuộc của học sinh, sinh viên trước mỗi kỳ thi, để gửi gắm niềm tin, cầu mong may mắn và kết quả tốt đẹp trong học tập. Đồng thời, Văn Miếu cũng là địa điểm chụp ảnh kỷ yếu, ảnh lưu niệm được nhiều thế hệ học trò lựa chọn, lưu giữ những khoảnh khắc đáng nhớ của tuổi học trò. Mỗi bước chân qua Khuê Văn Các, giếng Thiên Quang, những tấm bia Tiến sĩ như nhắc nhở về truyền thống tôn vinh hiền tài và giá trị bền vững của tri thức Việt Nam.",
        "description_en": "The Temple of Literature - Quoc Tu Giam is a prominent historical and cultural complex in Hanoi, located in Dong Da District, not far from the city center. Established in 1070, it stands as Vietnam first university, embodying the nation's long-standing tradition of studiousness and deep respect for education.\r\n\r\nAccording to historical records, the Temple of Literature (Van Mieu) was built to worship Confucius and other great sages, while Quoc Tu Giam served as the prestigious institution for training the country's elite throughout various feudal dynasties. Over the centuries, the complex has preserved numerous architectural treasures, such as the Khue Van Pavilion, Thien Quang Well, and the Doctoral Stelae, all of which vividly reflect the high value placed on literacy and scholarship by the ancient Vietnamese.\r\n\r\nVisiting the Temple of Literature, tourists can explore the history of education and the nation's scholarly traditions while soaking in the solemn and tranquil atmosphere of a space steeped in academic spirit. It has long been a popular destination for students before major exams, who come to seek luck and pray for academic success. Furthermore, it is a favored location for graduation photoshoots, where generations of students capture their most memorable school moments. Each step past the Khue Van Pavilion, the Thien Quang Well, and the Doctoral Stelae serves as a reminder of the tradition of honoring talent and the enduring value of Vietnamese intellect.",
        "additional_info": "• Khám phá kiến trúc và bia tiến sĩ: Đi dạo giữa các dãy nhà cổ và bia tiến sĩ.\n• Trải nghiệm viết thư pháp: Thử viết chữ trên giấy đỏ cùng ông đồ.\n• Hoạt cảnh “Sĩ tử ngày xưa”: Hóa thân thành học trò phong kiến.\n• Góc ảnh kỷ niệm “Nét học xưa”: Chụp ảnh cùng áo dài, sách bút.",
        "additional_info_en": "• Explore the architecture and Doctoral Stelae: Stroll amidst rows of ancient buildings and the stone stelae of Doctors.\r\n\r\n• Calligraphy writing experience: Try your hand at writing characters on red paper with a calligraphy master (Ong Do).\r\n\r\n• \"Scholars of the Past\" reenactment: Transform into a student of the feudal era.\r\n\r\n• \"Ancient Scholarly Charm\" photo corner: Take photos with Ao Dai, books, and ink brushes.",
        "created_at": "2026-01-10 15:14:35.121998+00"
    },
    {
        "id": 10,
        "title": "Trải nghiệm Cốm Làng Vòng",
        "title_key": "tour_title_10",
        "image": "",
        "images": [],
        "rating": 4.5,
        "reviews": 482,
        "price": 23.0,
        "type": [
            "Tour gia đình",
            "Tour chill cuối tuần",
            "Tour trường học"
        ],
        "departure": "hanoi",
        "destination": "vietnam",
        "transportation": "coach",
        "description": "Làng Vòng là một làng nghề truyền thống nổi tiếng của Hà Nội, gắn liền với nghề làm cốm – thức quà dân dã nhưng tinh tế, mang đậm hương vị mùa thu Thủ đô. Làng nằm ở khu vực Cầu Giấy ngày nay, từ lâu đã được biết đến với cốm Vòng dẻo thơm, xanh non, trở thành biểu tượng quen thuộc trong đời sống ẩm thực và văn hóa của người Hà Nội. Nhắc đến cốm Vòng là nhắc đến hình ảnh những gánh hàng rong, lá sen xanh, hương lúa non dịu nhẹ và nét thanh lịch rất riêng của đất Tràng An.\r\nĐến với làng cốm Vòng, du khách có cơ hội tìm hiểu về lịch sử hình thành và phát triển của nghề làm cốm, một nghề gắn bó mật thiết với mùa vụ và nhịp sống làng quê Bắc Bộ. Người dân nơi đây từ lâu đã truyền lại cho nhau kinh nghiệm chọn lúa nếp non đúng độ, rang thóc bằng lửa vừa, giã đều tay và sàng sảy cẩn thận để cho ra những hạt cốm mỏng, dẻo và thơm. Mỗi công đoạn đều đòi hỏi sự khéo léo, kiên nhẫn và cảm nhận tinh tế của người làm nghề, bởi chỉ cần sai lệch nhỏ cũng ảnh hưởng đến chất lượng cốm.\r\nKhông chỉ dừng lại ở việc quan sát, du khách còn có thể trực tiếp trải nghiệm một số công đoạn làm cốm như giã cốm, sàng cốm hay gói cốm trong lớp lá sen tươi. Khi tự tay gói cốm, cảm nhận hương sen hòa quyện cùng mùi lúa non, du khách sẽ hiểu rõ hơn vì sao cốm Vòng không chỉ là món ăn mà còn là một nét văn hóa. Cốm thường được dùng làm quà biếu, ăn kèm chuối chín, hoặc chế biến thành nhiều món truyền thống như bánh cốm, chả cốm, mang đậm hồn quê Hà Nội.\r\nHành trình đến với làng cốm Vòng không chỉ là chuyến tham quan một làng nghề cổ mà còn là dịp để du khách chạm vào ký ức Hà Nội xưa, cảm nhận nếp sống chậm rãi, tinh tế và trân trọng những giá trị truyền thống. Với ý nghĩa văn hóa sâu sắc và trải nghiệm nhẹ nhàng, làng cốm Vòng là điểm đến phù hợp cho các tour khám phá làng nghề, đặc biệt là các chương trình giáo dục dành cho học sinh và những ai yêu nét đẹp ẩm thực truyền thống Hà Nội.\r\n",
        "description_en": "Vong Village - The Soul of Hanoi's Autumn\r\nVong Village is a renowned traditional craft village in Hanoi, famous for its Cốm (green sticky rice) – a rustic yet refined delicacy that captures the very essence of the capital's autumn. Located in the present-day Cau Giay District, the village has long been celebrated for its fragrant, chewy, and vibrant green rice flakes, becoming an iconic symbol of Hanoian culinary and cultural life. To speak of Vong Village is to evoke images of street vendors, fresh lotus leaves, the subtle scent of young rice, and the distinctive elegance of the ancient Trang An.\r\n\r\nWhen visiting Vong Village, tourists can explore the history and evolution of this craft, which is intimately tied to the harvest cycles and the rhythm of Northern Vietnamese rural life. For generations, locals have passed down the secrets of selecting the perfect young glutinous rice, roasting it over a steady fire, and rhythmically winnowing and pounding the grains to create thin, supple, and aromatic flakes. Every step demands dexterity, patience, and a refined intuition; even a slight deviation can affect the final quality.\r\n\r\nBeyond observing, visitors can directly experience the craft by trying their hand at pounding, winnowing, or wrapping the Cốm in fresh lotus leaves. As you wrap the rice yourself and smell the lotus scent blending with the fragrance of young grain, you will truly understand why Cốm Vòng is more than just a dish—it is a cultural trait. Cốm is often given as a gift, enjoyed with ripe bananas, or processed into traditional treats like Cốm cakes or Cốm sausage, all of which embody the rustic soul of Hanoi.\r\n\r\nA journey to Vong Village is not merely a visit to an ancient craft village; it is an opportunity to touch the memories of old Hanoi, feel a slower pace of life, and appreciate traditional values. With its profound cultural significance, Vong Village is an ideal destination for craft village tours, educational programs for students, and anyone who cherishes the beauty of traditional Hanoian cuisine.",
        "additional_info": "• Tham quan/quan sát các công đoạn làm cốm (rang, giã, sàng… nếu có)\r\n\r\n\r\n• Thưởng thức cốm tươi, các món từ cốm (cốm xào, chả cốm, bánh cốm…)\r\n\r\n\r\n• Mua cốm làm quà, học cách chọn–bảo quản cốm đúng\r\n",
        "additional_info_en": "• Visit and observe the stages of making Green Rice: Watch the process including roasting, pounding, and sifting (if available).\r\n\r\n• Enjoy fresh Green Rice and its specialties: Taste dishes such as stir-fried green rice (Cốm xào), green rice pork patties (Chả cốm), and green rice cakes (Bánh cốm).\r\n\r\n• Buy Green Rice as gifts: Learn how to properly select and store green rice.",
        "created_at": "2026-01-29 06:49:24.310836+00"
    },
    {
        "id": 11,
        "title": "Trải nghiệm Làng Tò he Xuân La",
        "title_key": "Trải nghiệm Làng Tò he Xuân La",
        "image": "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056777/van-mieu-6.jpg",
        "images": [
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056781/van-mieu.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056775/van-mieu-3.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056777/van-mieu-5.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056773/tour-thach-that.jpg"
        ],
        "rating": 4.8,
        "reviews": 127,
        "price": 14.6,
        "type": [
            "Tour gia đình",
            "Tour chill cuối tuần",
            "tour trường học"
        ],
        "departure": "hanoi",
        "destination": "vietnam",
        "transportation": "bus",
        "description": "Làng tò he Xuân La là một làng nghề truyền thống đặc sắc của Hà Nội, nằm ven hồ Tây (quận Tây Hồ), gắn bó lâu đời với nghề nặn tò he - loại đồ chơi dân gian nhỏ bé nhưng chứa đựng đậm nét văn hóa làng quê Việt. Nghề tò he ở Xuân La đã được truyền qua nhiều thế hệ, gắn liền với hình ảnh những gánh hàng rong theo chân nghệ nhân đến các phiên chợ quê, lễ hội truyền thống và sân đình, trở thành một phần ký ức tuổi thơ thân thương của nhiều thế hệ người Việt.\nĐến với làng Xuân La, du khách có dịp tìm hiểu câu chuyện gìn giữ và phát triển làng nghề trong bối cảnh đời sống hiện đại. Mỗi con tò he không chỉ là món đồ chơi mà còn thể hiện sự tinh tế, óc quan sát và bàn tay khéo léo của người thợ thủ công.\nĐiểm đặc biệt hấp dẫn tại làng tò he Xuân La là hoạt động trải nghiệm nặn tò he. Dưới sự hướng dẫn của các nghệ nhân, du khách, đặc biệt là học sinh, có thể trực tiếp nhào bột, nặn hình các con vật, nhân vật cổ tích, nhân vật dân gian hoặc sáng tạo theo trí tưởng tượng riêng. Qua từng động tác đơn giản nhưng đòi hỏi sự tỉ mỉ và kiên nhẫn, người tham gia cảm nhận rõ niềm vui mộc mạc, sự sáng tạo và “linh hồn” được gửi gắm trong từng sản phẩm nhỏ bé.\nKhông chỉ mang tính giải trí, trải nghiệm nặn tò he còn giúp du khách hiểu và trân trọng hơn giá trị của nghề thủ công truyền thống, khơi gợi tình yêu văn hóa dân gian và ý thức gìn giữ di sản. Với nội dung vừa học vừa chơi, giàu tính tương tác, làng tò he Xuân La là điểm đến phù hợp cho các tour trải nghiệm văn hóa, đặc biệt là các chương trình giáo dục dành cho học sinh.\n",
        "description_en": "Xuân La Tò He Village – The Colors of Childhood Memories\nXuân La Tò He Village is a unique traditional craft village in Hanoi, located by West Lake (Tay Ho District). It is long-established for the craft of making Tò He—small, vibrant figurines made from rice dough that embody the rich cultural essence of the Vietnamese countryside. For generations, the craft of Xuân La has been associated with street vendors following artisans to rural markets, traditional festivals, and communal house courtyards, becoming a cherished childhood memory for many Vietnamese people.\n\nVisiting Xuân La, tourists have the chance to hear stories of how the village has preserved and developed its trade amidst modern life. Each Tò He figurine is not merely a toy but a testament to the artisan's sophistication, keen observation, and skillful hands.\n\nThe most captivating highlight at Xuân La is the hands-on Tò He modeling activity. Under the guidance of skilled artisans, visitors—especially students—can directly knead the dough and mold it into animals, fairy tale characters, folk figures, or anything from their own imagination. Through simple yet meticulous movements that require patience, participants can feel the rustic joy, creativity, and \"soul\" infused into each tiny creation.\n\nBeyond its entertainment value, the experience of making Tò He helps visitors understand and further appreciate the value of traditional handicrafts, sparking a love for folk culture and a sense of heritage preservation. With its \"learn-through-play\" and highly interactive nature, Xuân La Tò He Village is an ideal destination for cultural experience tours, particularly educational programs for students.",
        "additional_info": "• Xem nghệ nhân nặn tò he, nghe giới thiệu về lịch sử/ý nghĩa tò he\n\n• Tự tay nặn tò he (chọn hình con vật/nhân vật), mang về làm kỷ niệm\n\n• Chụp ảnh, mua tò he/đồ lưu niệm thủ công",
        "additional_info_en": "• Watch artisans mold To he: Listen to an introduction about the history and significance of these traditional dough figurines.\r\n\r\n• Make your own To he: Choose animal or character shapes to mold with your own hands and take them home as a souvenir.\r\n\r\n• Take photos and shop: Buy To he or other handmade souvenirs.",
        "created_at": "2026-01-29 06:51:50.420255+00"
    },
    {
        "id": 2,
        "title": "Trải nghiệm làng lụa Vạn Phúc",
        "title_key": "tour_title_2",
        "image": "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056738/lang-lua-van-phuc.jpeg",
        "images": [
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056726/lang-lua-van-phuc-1.webp",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056727/lang-lua-van-phuc-2.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056729/lang-lua-van-phuc-3.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056730/lang-lua-van-phuc-4.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056732/lang-lua-van-phuc-5.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056734/lang-lua-van-phuc-6.jpg"
        ],
        "rating": 4.9,
        "reviews": 267,
        "price": 25.0,
        "type": [
            "Tour chill cuối tuần",
            "Tour gia đình",
            "Tour trường học",
            "Tour đông lạnh"
        ],
        "departure": "hanoi",
        "destination": "vietnam",
        "transportation": "motorbike",
        "description": "Làng lụa Vạn Phúc là một làng nghề truyền thống nổi tiếng của Hà Nội, thuộc quận Hà Đông, cách trung tâm Thủ đô khoảng 10km. Với lịch sử hàng nghìn năm hình thành và phát triển, Vạn Phúc được xem là cái nôi của nghề dệt lụa tơ tằm Việt Nam. Những tấm lụa nơi đây nổi tiếng bởi độ mềm mại, nhẹ, óng ả, bền màu cùng hoa văn tinh tế, thể hiện sự khéo léo, tỉ mỉ và gu thẩm mỹ thanh lịch của người thợ làng nghề qua nhiều thế hệ.\r\nĐến với làng lụa Vạn Phúc, du khách có dịp tìm hiểu câu chuyện về nguồn gốc nghề dệt lụa, quá trình nuôi tằm, ươm tơ và dệt vải -  những công đoạn gắn liền với đời sống sinh hoạt của người dân địa phương. Dù ngày nay máy móc hiện đại đã được đưa vào sản xuất, nhiều gia đình vẫn gìn giữ phương pháp dệt truyền thống, xem đó như cách lưu giữ hồn cốt của làng nghề xưa.\r\nĐiểm đặc biệt hấp dẫn du khách là cơ hội trực tiếp trải nghiệm dệt lụa. Dưới sự hướng dẫn của các nghệ nhân, du khách có thể ngồi bên khung cửi, thử đưa thoi, dậm bàn đạp, cảm nhận nhịp dệt đều đặn và sự phối hợp nhịp nhàng giữa tay, chân và mắt để từng sợi tơ dần kết thành tấm lụa. Qua trải nghiệm này, du khách sẽ hiểu rõ hơn sự công phu, kiên nhẫn và khéo léo cần có để tạo nên một sản phẩm lụa hoàn chỉnh.\r\nBên cạnh hoạt động trải nghiệm, du khách còn có thể tham quan các xưởng dệt, dạo bước trên con phố lụa nổi tiếng, ngắm nhìn những dải lụa đủ màu sắc, hoa văn truyền thống xen lẫn hiện đại. Không gian làng nghề thanh lịch, yên bình cùng nét sinh hoạt đặc trưng của người dân Vạn Phúc mang đến cảm giác nhẹ nhàng, thư thái. Hành trình đến làng lụa Vạn Phúc không chỉ là chuyến tham quan làng nghề mà còn là dịp để du khách cảm nhận sâu sắc giá trị văn hóa, lịch sử và tinh hoa của nghề dệt lụa truyền thống Việt Nam.",
        "description_en": "Van Phuc Silk Village is a renowned traditional craft village in Hanoi, located in Ha Dong District, about 10km from the city center. With a history spanning over a thousand years, Van Phuc is considered the cradle of Vietnam’s silk weaving industry. Its silk is famous for being soft, lightweight, lustrous, and colorfast, featuring exquisite patterns that reflect the meticulous craftsmanship and elegant aesthetic of generations of local weavers.\r\n\r\nVisiting Van Phuc, tourists can discover the origins of silk weaving and the intricate journey of raising silkworms, reeling silk, and weaving fabric—processes deeply embedded in the daily lives of the locals. Although modern machinery has been introduced to production today, many families still preserve traditional weaving methods as a way to keep the \"soul\" of the ancient craft village alive.\r\n\r\nThe most captivating highlight for visitors is the opportunity for a hands-on weaving experience. Under the guidance of artisans, guests can sit at the loom, try tossing the shuttle, and operating the foot pedals. One can feel the steady rhythm and the harmonious coordination between hands, feet, and eyes as each silk thread gradually transforms into a beautiful fabric. This experience provides a deeper insight into the craftsmanship, patience, and dexterity required to create a finished silk product.\r\n\r\nIn addition to the hands-on activities, visitors can tour the weaving workshops and stroll along the famous Silk Street, admiring vibrant silk banners with patterns that blend tradition with modernity. The elegant, peaceful atmosphere of the village, combined with the distinctive lifestyle of the Van Phuc people, offers a sense of relaxation. A journey to Van Phuc is not just a sightseeing trip; it is an occasion to profoundly feel the cultural, historical, and quintessential values of Vietnam's traditional silk weaving.",
        "additional_info": "• Tham quan xưởng hoặc gia đình truyền thống đang duy trì nghề dệt.\n• Dạo quanh “chợ lụa Vạn Phúc”: lựa chọn vải lụa tơ tằm, lụa gấm.\n• Khám phá kiến trúc làng nghề: cổng làng, con đường ô treo màu sắc.",
        "additional_info_en": "• Visit workshops or traditional families maintaining the weaving craft: Observe the artisans at work in their local production sites.\r\n\r\n• Stroll around \"Van Phuc Silk Market\": Select natural silk and brocade fabrics (Lụa tơ tằm & Lụa gấm).\r\n\r\n• Explore the craft village architecture: Visit the ancient village gate and the street adorned with colorful hanging umbrellas.",
        "created_at": "2026-01-10 15:14:35.121998+00"
    },
    {
        "id": 3,
        "title": "Trải nghiệm làng nghề mây tre đan Phú Vinh",
        "title_key": "tour_title_3",
        "image": "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056742/lang-nghe-may-tre-dan-phu-vinh.jpg",
        "images": [
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056750/lang-tre-phu-vinh-1.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056751/lang-tre-phu-vinh-2.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056752/lang-tre-phu-vinh-3.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056752/lang-tre-phu-vinh-4.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056753/lang-tre-phu-vinh-5.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056754/lang-tre-phu-vinh-6.jpg"
        ],
        "rating": 4.7,
        "reviews": 521,
        "price": 22.0,
        "type": [
            "Tour gia đình",
            "Tour trường học",
            "Tour ngày hè"
        ],
        "departure": "hanoi",
        "destination": "vietnam",
        "transportation": "motorbike",
        "description": "Làng mây tre đan Phú Vinh là một trong những làng nghề truyền thống lâu đời và tiêu biểu của Hà Nội, thuộc huyện Chương Mỹ, cách trung tâm Thủ đô khoảng 30km. Từ nhiều thế hệ, nghề mây tre đan đã trở thành sinh kế chính và là niềm tự hào của người dân nơi đây, góp phần gìn giữ nét đẹp thủ công truyền thống giữa nhịp sống hiện đại.\r\nTheo lời kể của các bậc cao niên, nghề mây tre đan ở Phú Vinh đã hình thành từ hàng trăm năm trước, gắn liền với đời sống sinh hoạt của làng quê Bắc Bộ. Trải qua thời gian, các nghệ nhân Phú Vinh không ngừng sáng tạo, nâng tầm kỹ thuật đan truyền thống để tạo nên những sản phẩm vừa bền chắc, vừa tinh xảo. Đặc biệt, làng nghề nổi tiếng với các tác phẩm tranh mây tre đan mang giá trị nghệ thuật cao như tranh chân dung, tranh phong cảnh, tranh thư pháp, từng được giới thiệu và xuất khẩu ra nhiều quốc gia trên thế giới.\r\nKhi đến với làng nghề Phú Vinh, du khách có dịp tham quan không gian làng nghề mộc mạc, lắng nghe câu chuyện về quá trình gìn giữ và phát triển nghề truyền thống qua nhiều thế hệ. Du khách được tận mắt quan sát các công đoạn làm nghề như chọn mây tre, chẻ nan, vót sợi, xử lý nguyên liệu và đan tay hoàn toàn thủ công. Dưới sự hướng dẫn của các nghệ nhân, du khách còn có thể trực tiếp trải nghiệm đan những sản phẩm đơn giản, cảm nhận sự tỉ mỉ, kiên nhẫn và khéo léo trong từng thao tác.\r\nĐến với làng mây tre đan Phú Vinh, du khách không chỉ được tìm hiểu về một nghề thủ công truyền thống đặc sắc mà còn có cơ hội chạm vào nhịp sống bình dị của làng quê Việt, nơi lưu giữ những giá trị văn hóa bền bỉ và tinh thần sáng tạo của người thợ thủ công qua bao thế hệ.",
        "description_en": "Phu Vinh Bamboo and Rattan Village is one of the oldest and most prominent traditional craft villages in Hanoi. Located in Chuong My District, about 30km from the city center, the craft has been the primary livelihood and a source of pride for generations of locals, helping to preserve traditional handicraft beauty amidst modern life.\r\n\r\nAccording to the village elders, the craft in Phu Vinh was established hundreds of years ago, closely linked to the daily life of the Northern Vietnamese countryside. Over time, Phu Vinh's artisans have continuously innovated and elevated traditional weaving techniques to create products that are both durable and exquisite. Notably, the village is famous for its high-art bamboo and rattan woven portraits, landscapes, and calligraphy, which have been showcased and exported to many countries worldwide.\r\n\r\nVisiting Phu Vinh Village, tourists have the chance to explore a rustic craft space and listen to stories about preserving and developing this traditional trade through many generations. Visitors can observe firsthand the meticulous production stages, such as selecting materials, splitting bamboo, whittling fibers, treating raw materials, and entirely manual weaving. Under the guidance of skilled artisans, guests can even try weaving simple products themselves, experiencing the meticulousness, patience, and dexterity required in every movement.\r\n\r\nA journey to Phu Vinh Bamboo and Rattan Village offers more than just an insight into a unique traditional craft; it is an opportunity to touch the simple rhythm of the Vietnamese countryside, where enduring cultural values and the creative spirit of craftsmen have been preserved for generations.",
        "additional_info": "• Tham quan khu trưng bày sản phẩm mây tre đan.\n• Xem quy trình sản xuất: chọn cây mây/tre, xử lý, đan kết.\n• Giao lưu với nghệ nhân: nghe họ kể lịch sử làng nghề.",
        "additional_info_en": "• Visit the bamboo and rattan product showroom: Explore the display area for traditional woven products.\r\n\r\n• Observe the production process: Watch stages such as selecting bamboo/rattan materials, processing, and weaving.\r\n\r\n• Interact with artisans: Listen to stories about the history of the craft village.",
        "created_at": "2026-01-10 15:14:35.121998+00"
    },
    {
        "id": 4,
        "title": "Trải nghiệm làng nón Chuông",
        "title_key": "tour_title_4",
        "image": "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056749/lang-non-chuong.webp",
        "images": [
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056743/lang-non-chuong-1.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056744/lang-non-chuong-2.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056745/lang-non-chuong-3.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056746/lang-non-chuong-4.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056746/lang-non-chuong-5.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056747/lang-non-chuong-6.jpg"
        ],
        "rating": 4.6,
        "reviews": 198,
        "price": 20.0,
        "type": [
            "Tour gia đình",
            "Tour trường học",
            "Tour chill thu Hà Nội"
        ],
        "departure": "hanoi",
        "destination": "vietnam",
        "transportation": "bus",
        "description": "Làng nón Chuông là một làng nghề truyền thống nổi tiếng của Hà Nội, nằm ở huyện Thanh Oai, cách trung tâm Thủ đô khoảng 30km. Từ bao đời nay, nghề làm nón lá đã gắn bó mật thiết với đời sống sinh hoạt và lao động của người dân nơi đây, tạo nên những chiếc nón mỏng, nhẹ, bền và đẹp. Không chỉ là vật dụng che nắng che mưa quen thuộc, nón lá làng Chuông còn trở thành biểu tượng gần gũi của làng quê Bắc Bộ, gắn liền với hình ảnh người phụ nữ Việt Nam dịu dàng, mộc mạc.\r\nTheo lời kể của người dân địa phương, nghề làm nón ở làng Chuông đã tồn tại hàng trăm năm, được truyền từ đời này sang đời khác như một phần không thể thiếu trong nếp sống của làng. Dù trải qua nhiều biến động của thời gian, người dân làng Chuông vẫn bền bỉ giữ nghề, duy trì những kỹ thuật thủ công truyền thống để tạo nên chiếc nón có form tròn đều, đường kim mũi chỉ tinh tế và độ bền cao. Đặc biệt, các phiên chợ Chuông họp định kỳ từ lâu đã trở thành nơi giao thương nón lá nổi tiếng, góp phần gìn giữ và quảng bá nghề truyền thống của địa phương.\r\nKhi đến với làng nón Chuông, du khách không chỉ được nghe kể về lịch sử hình thành làng nghề và câu chuyện giữ nghề của các thế hệ nghệ nhân, mà còn có cơ hội trực tiếp tham gia trải nghiệm làm nón truyền thống. Dưới sự hướng dẫn tận tình của những người thợ lành nghề, du khách được tìm hiểu cách chọn lá nón, là phẳng từng tà lá, xếp lá lên khuôn sao cho đều và đẹp, sau đó khâu từng mũi kim cẩn thận để tạo dáng chiếc nón hoàn chỉnh. Mỗi công đoạn đều đòi hỏi sự khéo léo, kiên nhẫn và tập trung, giúp người trải nghiệm cảm nhận rõ sự công phu ẩn sau vẻ ngoài giản dị của chiếc nón lá.\r\nChiếc nón sau khi hoàn thiện tuy mộc mạc nhưng mang đậm dấu ấn cá nhân của người làm, trở thành một kỷ niệm nhỏ đầy ý nghĩa. Thông qua trải nghiệm này, du khách không chỉ hiểu hơn về kỹ thuật làm nón mà còn cảm nhận được giá trị văn hóa, tinh thần lao động cần mẫn và tình yêu nghề của người dân làng Chuông. Đây là điểm đến phù hợp cho các tour trải nghiệm làng nghề, đặc biệt là các chương trình giáo dục dành cho học sinh, giúp các em thêm trân trọng những nghề thủ công truyền thống của quê hương.",
        "description_en": "Chuông Village is a renowned traditional craft village in Hanoi, located in Thanh Oai District, approximately 30km from the city center. For generations, the craft of making Nón Lá (conical hats) has been intimately woven into the daily lives and labor of the local people, resulting in hats that are thin, lightweight, durable, and elegant. Beyond being a common practical item for sun and rain protection, the Chuông conical hat has become a familiar symbol of the Northern Vietnamese countryside, synonymous with the gentle and rustic image of Vietnamese women.\r\n\r\nAccording to local lore, the craft in Chuông Village has flourished for centuries, passed down through generations as an indispensable part of the village's way of life. Despite the ebbs and flows of time, the villagers have steadfastly preserved their trade, maintaining traditional manual techniques to produce hats with perfectly round forms, exquisite stitching, and high durability. Notably, the periodic Chuông market sessions have long been famous trading hubs for conical hats, playing a vital role in preserving and promoting this local heritage.\r\n\r\nVisiting Chuông Village, tourists can not only hear stories of the village’s history and the artisans’ dedication to their craft but also have the opportunity to participate in the traditional hat-making process. Under the dedicated guidance of skilled craftsmen, visitors learn how to select the best leaves, flatten each leaf segment, arrange them evenly on the mold, and carefully sew each stitch to complete the hat’s shape. Every stage demands dexterity, patience, and focus, allowing participants to fully appreciate the elaborate craftsmanship hidden behind the simple appearance of a conical hat.\r\n\r\nA finished hat, though rustic, bears the personal touch of its maker, becoming a meaningful memento. Through this experience, visitors gain a deeper understanding of hat-making techniques and feel the cultural values, diligent labor, and passion of the Chuông villagers. This is an ideal destination for craft village tours, especially educational programs for students, helping them further cherish the traditional handicrafts of their homeland.",
        "additional_info": "• Tham quan xưởng làm nón: Quan sát nghệ nhân làm từng công đoạn.\n• Tự tay làm chiếc nón: Thử cắt lá, lợp khung.\n• Mua sắm tại phiên chợ nón (họp vào các ngày 4, 10, 14... âm lịch).",
        "additional_info_en": "• Visit a conical hat workshop: Observe artisans working on each stage of the process.\r\n\r\n• Make your own conical hat: Try cutting palm leaves and arranging them on the frame.\r\n\r\n• Shop at the traditional hat market: Held on specific days (4th, 10th, 14th...) of the lunar month.",
        "created_at": "2026-01-10 15:14:35.121998+00"
    },
    {
        "id": 5,
        "title": "Trải nghiệm Thung lung Bản xôi",
        "title_key": "tour_title_5",
        "image": "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056762/thung-lung-ban-xoi.jpg",
        "images": [
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056757/thung-lung-ban-xoi-1.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056758/thung-lung-ban-xoi-2.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056759/thung-lung-ban-xoi-3.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056760/thung-lung-ban-xoi-4.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056761/thung-lung-ban-xoi-5.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056761/thung-lung-ban-xoi-6.jpg"
        ],
        "rating": 4.9,
        "reviews": 156,
        "price": 25.0,
        "type": [
            "Tour gia đình",
            "Tour trường học",
            "Tour chill thu Hà Nội",
            "Tour chill cuối tuần"
        ],
        "departure": "hanoi",
        "destination": "vietnam",
        "transportation": "motorbike",
        "description": "Thác Bản Xôi là điểm du lịch sinh thái nằm dưới chân núi Ba Vì, cách trung tâm Hà Nội khoảng 40km, được bao quanh bởi núi rừng xanh mát và không gian thiên nhiên trong lành. Nơi đây gây ấn tượng với dòng thác nước chảy hiền hòa, hồ nước rộng, bãi cỏ thoáng đãng cùng cảnh quan gần gũi, tạo cảm giác thư thái, dễ chịu ngay từ những bước chân đầu tiên.\r\nĐến với Thác Bản Xôi, du khách có thể tản bộ giữa không gian núi rừng yên bình, ngắm thác nước róc rách, hít thở bầu không khí trong lành và tạm rời xa sự ồn ào, náo nhiệt của phố thị. Không gian rộng rãi và tự nhiên nơi đây rất thích hợp để nghỉ ngơi, thư giãn, chụp ảnh lưu niệm hoặc đơn giản là tận hưởng khoảnh khắc yên tĩnh giữa thiên nhiên.\r\nBên cạnh hoạt động tham quan, Thác Bản Xôi còn là địa điểm lý tưởng để tổ chức các hoạt động trải nghiệm ngoài trời, đặc biệt phù hợp với các đoàn học sinh. Trong không gian cỏ xanh thoáng đãng, các em có thể tham gia múa sạp, nhảy dân vũ tập thể, tạo nên bầu không khí vui tươi, sôi nổi và gắn kết. Ngoài ra, nhiều trò chơi dân gian như kéo co, nhảy bao bố, bịt mắt bắt dê, ném còn… cũng được tổ chức, giúp học sinh rèn luyện thể chất, tăng tinh thần đồng đội và kỹ năng làm việc nhóm. Du khách còn có thể tổ chức picnic, sinh hoạt tập thể, cắm trại nhẹ trong ngày, cùng nhau tìm hiểu về thiên nhiên, môi trường và ý thức bảo vệ cảnh quan sinh thái. Những hoạt động này mang lại trải nghiệm “vừa học vừa chơi”, giúp học sinh gần gũi hơn với thiên nhiên, phát triển kỹ năng sống và lưu giữ những kỷ niệm đáng nhớ.\r\nVới cảnh quan tự nhiên hài hòa, không gian rộng rãi, dễ di chuyển và hệ thống hoạt động trải nghiệm đa dạng, Thác Bản Xôi là điểm đến phù hợp cho các tour trải nghiệm thiên nhiên – kỹ năng sống, dã ngoại cuối tuần và các chương trình ngoại khóa dành cho học sinh.",
        "description_en": "Ban Xoi Waterfall is an eco-tourism destination nestled at the foot of Ba Vi Mountain, approximately 40km from the center of Hanoi. Surrounded by lush forests and fresh natural air, the site impresses visitors with its gentle waterfalls, expansive lake, and open grassy fields. The intimate landscape creates a sense of relaxation and comfort from the very first step.\r\n\r\nAt Ban Xoi, visitors can stroll through the peaceful forest, listen to the babbling waterfall, and breathe in the crisp air to escape the hustle and bustle of city life. The spacious, natural environment is perfect for resting, taking souvenir photos, or simply enjoying a quiet moment amidst nature.\r\n\r\nBeyond sightseeing, Ban Xoi Waterfall is an ideal venue for outdoor experiential activities, particularly suited for student groups. In the vast green meadows, students can participate in Múa Sạp (bamboo pole dancing) and collective folk dances, creating a joyful, vibrant, and bonding atmosphere. Additionally, various traditional games such as tug-of-war, sack racing, blind man’s buff, and shuttlecock throwing are organized to help students improve physical fitness and enhance teamwork skills. Visitors can also enjoy picnics, group gatherings, or light day camping while learning about nature and environmental conservation. These activities offer a \"learn-through-play\" experience, helping students connect with nature, develop life skills, and create unforgettable memories.\r\n\r\nWith its harmonious natural landscape, ease of access, and diverse range of experiential activities, Ban Xoi Waterfall is a premier destination for nature-based skill tours, weekend getaways, and extracurricular programs for students.",
        "additional_info": "• Tham quan nhà sàn, tìm hiểu văn hóa người Mường.\n• Trải nghiệm nấu cơm lam, làm đồ thủ công.\n• Tổ chức team building và đốt lửa trại.\n• Chèo thuyền kayak, check-in bên hồ.",
        "additional_info_en": "• Visit traditional stilt houses: Learn about the culture of the Muong ethnic group.\r\n\r\n• Experience local activities: Cook bamboo-tube rice (Com lam) and make handicrafts.\r\n\r\n• Team building and campfire: Organize team building activities and enjoy a bonfire night.\r\n\r\n• Kayaking and lakeside check-in: Go kayaking and take photos by the lake.",
        "created_at": "2026-01-10 15:14:35.121998+00"
    },
    {
        "id": 6,
        "title": "Trải nghiệm làng gốm Bát Tràng",
        "title_key": "tour_title_6",
        "image": "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056724/lang-gom-bat-trang.webp",
        "images": [
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056717/lang-gom-bat-trang-1.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056719/lang-gom-bat-trang-2.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056720/lang-gom-bat-trang-3.webp",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056721/lang-gom-bat-trang-4.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056722/lang-gom-bat-trang-5.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056723/lang-gom-bat-trang-6.webp"
        ],
        "rating": 4.5,
        "reviews": 423,
        "price": 15.0,
        "type": [
            "Tour gia đình",
            "Tour trường học",
            "Tour chill cuối tuần"
        ],
        "departure": "hanoi",
        "destination": "vietnam",
        "transportation": "bus",
        "description": "Làng gốm Bát Tràng là một làng cổ lâu đời nằm bên bờ sông Hồng, thuộc huyện Gia Lâm, cách trung tâm Hà Nội khoảng 15km. Nhờ vị trí thuận lợi về giao thông đường thủy và nguồn đất sét dồi dào, từ rất sớm người dân nơi đây đã hình thành và phát triển nghề làm gốm sứ. Trải qua nhiều thế hệ, nghề gốm Bát Tràng không chỉ là sinh kế mà còn trở thành niềm tự hào của người dân địa phương, góp phần tạo nên bản sắc văn hóa đặc trưng của làng nghề ven sông.\r\nGốm Bát Tràng nổi tiếng bởi kỹ thuật tạo hình tinh xảo, lớp men phong phú và màu sắc trang nhã. Các nghệ nhân nơi đây đã không ngừng sáng tạo, kết hợp kinh nghiệm truyền thống với sự cải tiến về kỹ thuật lò nung để cho ra đời những sản phẩm bền đẹp, hài hòa về bố cục, từ đồ gia dụng, đồ thờ cúng đến các sản phẩm trang trí, mỹ thuật. Mỗi sản phẩm đều được “thổi hồn” bằng bàn tay khéo léo và tâm huyết của người thợ, phản ánh sự tinh tế và óc thẩm mỹ của con người Bát Tràng qua từng thời kỳ.\r\nĐến với làng cổ Bát Tràng, du khách không chỉ được tìm hiểu về nghề gốm mà còn có dịp chiêm ngưỡng những công trình kiến trúc lâu đời như nhà cổ Vạn Vân, đình làng Bát Tràng, cùng hệ thống ngõ xóm mang đậm dấu ấn làng quê Bắc Bộ. Dạo bước trong không gian làng cổ, du khách có thể cảm nhận rõ nhịp sống chậm rãi, bình yên của một làng nghề truyền thống nằm bên dòng sông Hồng đỏ nặng phù sa.\r\nMột trong những trải nghiệm hấp dẫn nhất khi đến Bát Tràng là hoạt động tự tay làm gốm. Trong không gian xưởng nghề mộc mạc, dưới sự hướng dẫn tận tình của các nghệ nhân, du khách được trực tiếp chạm tay vào đất sét, ngồi bên bàn xoay để tạo hình những sản phẩm đơn giản như cốc, bát, bình nhỏ hay con giống. Sau đó, du khách có thể tô vẽ hoa văn, trang trí theo ý thích và tìm hiểu quy trình tráng men, nung gốm. Thành phẩm sau khi hoàn thiện trở thành một kỷ niệm nhỏ mang dấu ấn cá nhân, giúp du khách hiểu sâu hơn về sự công phu, kiên nhẫn và giá trị văn hóa của nghề gốm truyền thống Bát Tràng.",
        "description_en": "Bat Trang Pottery Village is an ancient village situated along the banks of the Red River in Gia Lâm District, about 15km from the center of Hanoi. Thanks to its favorable location for water transport and an abundance of white clay, the locals established and developed the craft of ceramics from a very early stage. Through many generations, Bat Trang pottery has evolved from a mere livelihood into a source of local pride, shaping the unique cultural identity of this riverside craft village.\r\n\r\nBat Trang ceramics are renowned for their exquisite shaping techniques, diverse glazes, and elegant colors. Artisans here have continuously innovated, blending traditional experience with improvements in kiln technology to produce durable and aesthetically harmonious products—ranging from household wares and ritual objects to decorative and fine art pieces. Every item is \"breathed into life\" by the skillful hands and dedication of the craftsmen, reflecting the sophistication and aesthetic vision of the Bat Trang people throughout different eras.\r\n\r\nVisiting the ancient village of Bat Trang, tourists can explore the history of the craft while admiring long-standing architectural landmarks such as the Van Van Ancient House, Bat Trang Communal House, and a network of narrow alleys imbued with the characteristics of Northern Vietnamese rural life. Walking through the ancient village, visitors can clearly feel the slow and peaceful pace of a traditional craft village nestled by the silt-rich Red River.\r\n\r\nOne of the most captivating experiences at Bat Trang is the hands-on pottery making. In the rustic atmosphere of a workshop, under the devoted guidance of artisans, visitors can directly touch the clay and sit at the potter’s wheel to mold simple items like cups, bowls, small vases, or animal figurines. Afterward, they can paint patterns, decorate to their heart's content, and learn about the glazing and firing processes. The finished product serves as a personalized memento, helping visitors gain a deeper appreciation for the meticulousness, patience, and cultural value of Bat Trang’s traditional pottery.",
        "additional_info": "• Tham quan xưởng gốm thủ công.\n• Workshop “Nặn gốm – gửi hồn vào đất”.\n• Khám phá chợ gốm cổ.\n• Check-in “Con đường gốm sứ”.",
        "additional_info_en": "• Visit a traditional pottery workshop: Tour the facility to see how ceramics are made.\r\n\r\n• \"Pottery Molding – Breathing Soul into Clay\" Workshop: Try your hand at making pottery and bringing clay to life.\r\n\r\n• Explore the ancient pottery market: Browse and shop for unique ceramic items.\r\n\r\n• Check-in at the \"Ceramic Road\": Take photos along the street adorned with pottery art.",
        "created_at": "2026-01-10 15:14:35.121998+00"
    },
    {
        "id": 7,
        "title": "Hơi thở Xứ Đoài",
        "title_key": "tour_title_7",
        "image": "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056773/tour-thach-that.jpg",
        "images": [
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056763/tour-thach-that-1.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056766/tour-thach-that-2.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056768/tour-thach-that-3.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056769/tour-thach-that-4.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056770/tour-thach-that-5.jpg",
            "https://res.cloudinary.com/dczdnu2ba/image/upload/v1768056771/tour-thach-that-6.jpg"
        ],
        "rating": 5.0,
        "reviews": 678,
        "price": 10.8,
        "type": [
            "Tour gia đình",
            "Tour trường học",
            "Tour chill cuối tuần"
        ],
        "departure": "hanoi",
        "destination": "vietnam",
        "transportation": "motorbike",
        "description": "Cách trung tâm Hà Nội hơn 30km, Thạch Thất lưu giữ tinh hoa văn hoá lâu đời (làng quạt Chàng Sơn, làng mộc Canh Nậu, chùa Tây Phương).\nTour đưa bạn đến gần hơn với giá trị truyền thống qua trải nghiệm làm quạt, điêu khắc gỗ.",
        "description_en": "Located over 30km from the center of Hanoi, Thạch Thất preserves a wealth of long-standing cultural essence, featuring the Chàng Sơn fan-making village, Canh Nậu woodworking village, and the ancient Tây Phương Pagoda.\r\n\r\nThis tour brings you closer to traditional values through hands-on experiences in fan-making and wood carving.",
        "additional_info": "• Thời gian: 07h30 – 16h30 \r\n• 07h30: Đón đoàn đi Thạch Thất. 08h45: Tham quan chùa Tây Phương. \r\n• 10h00: Thăm làng quạt Chàng Sơn. \r\n• 13h30: Workshop làm quạt giấy, trò chơi dân gian.\r\n• 16h30: Di chuyển về",
        "additional_info_en": "• Time: 07:30 – 16:30 \r\n• 07:30: Pick up and transfer to Thach That. \r\n• 08:45: Visit Tay Phuong Pagoda. \r\n• 10:00: Visit Chang Son Fan Village. \r\n• 13:30: Paper fan making workshop and folk games.\r\n• Come back to Thach That.",
        "created_at": "2026-01-10 15:14:35.121998+00"
    },
    {
        "id": 8,
        "title": "Trải nghiệm Làng Hương",
        "title_key": "tour_title_8",
        "image": "",
        "images": [],
        "rating": 4.7,
        "reviews": 317,
        "price": 19.7,
        "type": [
            "Tour gia đình",
            "Tour trường học",
            "Tour chill thu Hà Nội"
        ],
        "departure": "hanoi",
        "destination": "vietnam",
        "transportation": "coach",
        "description": "Làng hương Quảng Phú Cầu hay còn gọi là làng hương Xà Cầu là địa điểm check-in khá nổi tiếng nằm ở ngoại ô Hà Nội, cách trung tâm Thủ đô khoảng 35km. Làng nghề tăm hương Quảng Phú Cầu Ứng Hòa (nay là xã Ứng Thiên), có lịch sử làm tăm hương truyền thống suốt hơn 1 thế kỷ. \r\nNói về lịch sử của làng nghề tăm hương Quảng Phú Cầu lâu đời tại Hà Nội, từ bao đời nay, nghề tăm hương vẫn luôn là một trong những nghề truyền thống gắn liền với những thế hệ người dân Việt Nam. Thời gian thấm thoát thoi đưa, may mắn thay những làng nghề ở Hà Nội vẫn được duy trì bởi những đôi tay thoăn thoắt, khéo léo của những người thợ lành nghề. Trong đó, có Làng hương Quảng Phú Cầu chuyên về làm hương. Dù đã tồn tại hơn trăm tuổi, đến hiện tại, làng tăm hương Quảng Phú Cầu vẫn tồn tại theo năm tháng và trở thành một trong những nét đẹp đặc biệt khắc hoạ rõ nét văn hoá của làng quê đồng bằng Bắc Bộ. \r\nTại Làng Hương Quảng Phú Cầu, du khách được tham quan và trải nghiệm trực tiếp quy trình làm hương truyền thống, từ các công đoạn chuẩn bị que hương như cạo, chẻ, cắt vầu cho đến sàng lọc bằng máy móc. Bên cạnh đó, khách còn được tham gia các hoạt động tương tác như nhuộm chân nhang, bắn nhang và thu hương ngoài đồng. Những hoạt động này không chỉ giúp du khách hiểu rõ giá trị lao động của làng nghề, mà còn tạo ấn tượng mạnh về mặt thị giác thông qua không gian “biển hương”\r\n",
        "description_en": "Quang Phu Cau Incense Village (also known as Xa Cau) is a famous photography and check-in destination located on the outskirts of Hanoi, about 35km from the city center. This craft village in Ung Hoa District has a storied history of traditional incense stick making spanning over a century.\r\n\r\nThroughout generations, incense making has remained a traditional craft deeply intertwined with the lives of the Vietnamese people. As time flies, these craft villages in Hanoi have fortunately been preserved by the nimble and skillful hands of expert artisans. Despite being over a hundred years old, Quang Phu Cau continues to thrive, standing as a unique cultural highlight that vividly portrays the heritage of the Northern Delta countryside.\r\n\r\nAt Quang Phu Cau, visitors can observe and directly experience the traditional incense-making process—from preparing the sticks by scraping, splitting, and cutting the bamboo to mechanized sorting. Furthermore, guests can engage in interactive activities such as dyeing the \"incense feet\" (the bottom of the sticks), mechanical coating, and gathering incense bundles in the fields. These activities not only help visitors appreciate the labor value of the craft village but also create a powerful visual impact through the mesmerizing \"sea of incense\"—where bundles are spread out like blooming flowers.",
        "additional_info": "• Xem phơi hương, nhuộm chân hương, se hương và đóng gói\r\n\r\n• Trải nghiệm tự se hương/ bó hương, chụp ảnh “cánh đồng hương”\r\n\r\n• Mua hương truyền thống, tìm hiểu các loại hương (trầm, quế, thảo mộc…)",
        "additional_info_en": "• Watch the drying, dyeing, rolling, and packaging of incense: Observe the full production process.\r\n\r\n• Try your hand at rolling or bundling incense: Experience the craft yourself and take photos at the \"incense fields.\"\r\n\r\n• Buy traditional incense: Learn about different varieties (agarwood, cinnamon, herbal...).",
        "created_at": "2026-01-29 06:43:04.903832+00"
    },
    {
        "id": 9,
        "title": "Trải nghiệm Chùa Thanh Âm",
        "title_key": "tour_title_9",
        "image": "",
        "images": [],
        "rating": 5.0,
        "reviews": 520,
        "price": 15.4,
        "type": [
            "Tour gia đình",
            "Tour trường học",
            "Tour chill cuối tuần"
        ],
        "departure": "hanoi",
        "destination": "vietnam",
        "transportation": "coach",
        "description": " Chùa Thanh Âm - khu Cháy Anh Hùng - một địa điểm du lịch mới, nổi tiếng là chốn bồng lai tiên cảnh giữa vùng chiêm trũng thuộc phía nam Hà Nội.Chỉ cách Hà Nội 30km về phía nam, nơi đây thích hợp cho những chuyến dã ngoại trong ngày, để tận hưởng cảm giác yên tĩnh và tiêu dao. \r\nTheo truyền kể của người dân địa phương, chùa Thanh Âm là nơi tôn thờ Đức Bà Chúa Cháy, vị thần gắn với lịch sử hình thành và đời sống tín ngưỡng của làng Cháy xưa. Trải qua thời gian, chùa không chỉ là nơi sinh hoạt tâm linh mà còn lưu giữ những giá trị văn hóa truyền thống của cộng đồng làng nghề.\r\nVào các ngày 14 và 30 âm lịch hằng tháng, du khách đến chùa Thanh Âm có thể tham gia những hoạt động tâm linh do chùa tổ chức như tụng kinh Địa Tạng và lễ phóng sinh, mang ý nghĩa cầu an, hướng con người đến điều thiện và sự an yên trong tâm hồn. Bên cạnh đó, bất kỳ ngày nào trong tuần, du khách cũng có thể tham quan, vãn cảnh chùa, đồng thời trải nghiệm quy trình nhuộm vải cổ truyền và tự tay làm hoa vải để trang trí chùa- những hoạt động diễn ra hằng ngày, nhẹ nhàng, gần gũi và giàu giá trị văn hóa truyền thống.\r\nĐến với chùa Thanh Âm, du khách không chỉ tìm thấy sự tĩnh lặng nơi cửa Phật mà còn có dịp chạm vào lịch sử, nghề xưa và nếp sống mộc mạc của làng quê, để lại những cảm xúc bình dị nhưng khó quên.\r\n",
        "description_en": "Thanh Am Pagoda, located in the heroic \"Khu Chay\" region, is an emerging destination renowned as a \"celestial landscape\" amidst the low-lying plains south of Hanoi. Situated just 30km from the city center, this site is ideal for day trips to enjoy a sense of tranquility and carefree liberation.\r\n\r\nAccording to local legend, Thanh Am Pagoda is dedicated to Duc Ba Chua Chay (The Lady of the Chay Region), a deity closely linked to the historical formation and spiritual life of the ancient Chay village. Over time, the pagoda has evolved into more than just a place of worship; it also preserves the traditional cultural values of the local craft community.\r\n\r\nOn the 14th and 30th days of each lunar month, visitors can join spiritual activities organized by the pagoda, such as chanting the Ksitigarbha Sutra and participating in the merit-release ceremony (release of captive animals), which symbolize prayers for peace and guide the soul toward kindness. Additionally, on any day of the week, guests can stroll through the pagoda grounds and experience the traditional fabric dyeing process or try their hand at making fabric flowers to decorate the pagoda. These daily activities are gentle, approachable, and rich in traditional heritage.\r\n\r\nA visit to Thanh Am Pagoda offers more than just the silence of a Buddhist sanctuary; it is an opportunity to touch history, ancient crafts, and the rustic lifestyle of the Vietnamese countryside, leaving behind simple yet unforgettable emotions.",
        "additional_info": "• Tham quan kiến trúc, nghe giới thiệu lịch sử và các ban thờ\r\n\r\n• Dâng hương/lễ chùa, tham gia thiền, phóng sinh, cầu an\r\n\r\n• Trải nghiệm nhuộm vải, check in trong không gian linh thiêng mà cũng rất thơ mộng \r\n",
        "additional_info_en": "• Explore the architecture: Listen to the history and learn about the various altars.\r\n\r\n• Offer incense and worship: Participate in meditation, release birds/fish (life release ritual), and pray for peace.\r\n\r\n• Fabric dyeing experience: Take photos in a setting that is both sacred and poetic.",
        "created_at": "2026-01-29 06:45:46.550668+00"
    }
]